<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<dataset id="qald-5_train.xml">
	<question aggregation="false" answertype="resouce" hybrid="true"
		id="301" onlydbo="true">
		<string lang="en">Who was vice-president under the president who
			authorized atomic weapons against Japan during World War II?</string>
		<pseudoquery>PREFIX text:&lt;http://jena.apache.org/text#&gt;
			SELECT DISTINCT ?proj WHERE {
			?const text:query (&lt;http://dbpedia.org/ontology/abstract&gt; '"atomic
			weapons"' 1000).
			?const &lt;http://dbpedia.org/ontology/vicePresident&gt; ?proj.
			}
			LIMIT 1
		</pseudoquery>
		<answers>
			<answer>http://dbpedia.org/resource/Richard_Nixon</answer>
		</answers>
	</question>
	<question aggregation="false" answertype="resouce" hybrid="true"
		id="305" onlydbo="true">
		<string lang="en">Which recipients of the Victoria Cross died in the
			Battle of Arnhem?</string>
		<pseudoquery>PREFIX text:&lt;http://jena.apache.org/text#&gt;
			SELECT DISTINCT ?proj WHERE {
			?const text:query (&lt;http://dbpedia.org/ontology/abstract&gt; '"Battle of
			Arnhem"' 1000).
			?const &lt;http://dbpedia.org/ontology/award&gt; ?proj.
			}
			LIMIT 12
		</pseudoquery>
		<answers>
			<answer>http://dbpedia.org/resource/German_Cross</answer>
			<answer>http://dbpedia.org/resource/Wound_Badge</answer>
			<answer>http://dbpedia.org/resource/Eastern_Front_Medal</answer>
			<answer>http://dbpedia.org/resource/Close_Combat_Clasp</answer>
			<answer>http://dbpedia.org/resource/Distinguished_Service_Order
			</answer>
			<answer>http://dbpedia.org/resource/Order_of_the_Bath</answer>
			<answer>http://dbpedia.org/resource/Military_Cross</answer>
			<answer>http://dbpedia.org/resource/Knight's_Cross_of_the_Iron_Cross
			</answer>
			<answer>http://dbpedia.org/resource/Iron_Cross</answer>
			<answer>http://dbpedia.org/resource/Order_of_the_British_Empire
			</answer>
			<answer>http://dbpedia.org/resource/General_Assault_Badge</answer>
			<answer>http://dbpedia.org/resource/Medal_bar</answer>
		</answers>
	</question>
	<question aggregation="false" answertype="resouce" hybrid="true"
		id="308" onlydbo="true">
		<string lang="en">Which members of the Wu-Tang Clan took their stage
			name from a movie?</string>
		<pseudoquery>PREFIX text:&lt;http://jena.apache.org/text#&gt;
			SELECT DISTINCT ?proj WHERE {
			?proj text:query (&lt;http://dbpedia.org/ontology/abstract&gt; '"Wu-Tang
			Clan" AND "stage name"' 1000).
			?const &lt;http://dbpedia.org/ontology/bandMember&gt; ?proj.
			}
			LIMIT 12
		</pseudoquery>
		<answers>
			<answer>http://dbpedia.org/resource/4th_Disciple</answer>
			<answer>http://dbpedia.org/resource/Killah_Priest</answer>
			<answer>http://dbpedia.org/resource/Stza</answer>
			<answer>http://dbpedia.org/resource/Ghostface_Killah</answer>
			<answer>http://dbpedia.org/resource/Gza</answer>
			<answer>http://dbpedia.org/resource/Cappadonna</answer>
			<answer>http://dbpedia.org/resource/Inspectah_Deck</answer>
			<answer>http://dbpedia.org/resource/Rza</answer>
			<answer>http://dbpedia.org/resource/Raekwon</answer>
			<answer>http://dbpedia.org/resource/Cilvaringz</answer>
			<answer>http://dbpedia.org/resource/Hell_Razah</answer>
			<answer>http://dbpedia.org/resource/60_Second_Assassin_(emcee)
			</answer>
		</answers>
	</question>
	<question aggregation="false" answertype="resouce" hybrid="true"
		id="309" onlydbo="true">
		<string lang="en">Which writers had influenced the philosopher that
			refused a Nobel Prize?</string>
		<pseudoquery>PREFIX text:&lt;http://jena.apache.org/text#&gt;
			SELECT DISTINCT ?proj WHERE {
			?const text:query (&lt;http://dbpedia.org/ontology/abstract&gt; '"Nobel
			Prize"' 1000).
			?proj &lt;http://dbpedia.org/ontology/influencedBy&gt; ?const.
			?proj a &lt;http://dbpedia.org/ontology/Writer&gt;.
			}
			LIMIT 12
		</pseudoquery>
		<answers>
			<answer>http://dbpedia.org/resource/Patrick_Cullinan</answer>
			<answer>http://dbpedia.org/resource/Guillermo_Sheridan</answer>
			<answer>http://dbpedia.org/resource/Michael_Palmer_(poet)</answer>
			<answer>http://dbpedia.org/resource/Hannes_Hólmsteinn_Gissurarson
			</answer>
			<answer>http://dbpedia.org/resource/Jyoti_Guptara</answer>
			<answer>http://dbpedia.org/resource/Margherita_Guidacci</answer>
			<answer>http://dbpedia.org/resource/Fernando_Cabrera_(writer)
			</answer>
			<answer>http://dbpedia.org/resource/Dan_Lungu</answer>
			<answer>http://dbpedia.org/resource/Greg_F._Gifune</answer>
			<answer>http://dbpedia.org/resource/Stephen_King</answer>
			<answer>http://dbpedia.org/resource/Octavio_Paz</answer>
			<answer>http://dbpedia.org/resource/Suresh_Guptara</answer>
		</answers>
	</question>
	<question aggregation="false" answertype="resouce" hybrid="true"
		id="311" onlydbo="true">
		<string lang="en">Who composed the music for the film that depicts
			the early life of Jane Austin?</string>
		<pseudoquery>PREFIX text:&lt;http://jena.apache.org/text#&gt;
			SELECT DISTINCT ?proj WHERE {
			?const text:query (&lt;http://dbpedia.org/ontology/abstract&gt; '"music"
			AND "Jane Austin"' 1000).
			?const &lt;http://dbpedia.org/ontology/composer&gt; ?proj.
			?proj a &lt;http://dbpedia.org/ontology/Agent&gt;.
			}
			LIMIT 1
		</pseudoquery>
		<answers>
			<answer>http://dbpedia.org/resource/Aimee_Mann</answer>
		</answers>
	</question>
	<question aggregation="false" answertype="resouce" hybrid="true"
		id="315" onlydbo="true">
		<string lang="en">Of the people that died of radiation in Los
			Alamos, whose death was an accident?</string>
		<pseudoquery>PREFIX text:&lt;http://jena.apache.org/text#&gt;
			SELECT DISTINCT ?proj WHERE {
			?const text:query (&lt;http://dbpedia.org/ontology/abstract&gt; '"death"
			AND "people"' 1000).
			?const &lt;http://dbpedia.org/ontology/deathPlace&gt; ?proj.
			}
			LIMIT 1
		</pseudoquery>
		<answers>
			<answer>http://dbpedia.org/resource/Middletown,_Connecticut</answer>
		</answers>
	</question>
	<question aggregation="false" answertype="resouce" hybrid="true"
		id="316" onlydbo="true">
		<string lang="en">Which building owned by the Bank of America was
			featured in the TV series MegaStructures?</string>
		<pseudoquery>PREFIX text:&lt;http://jena.apache.org/text#&gt;
			SELECT DISTINCT ?proj WHERE {
			?proj text:query (&lt;http://dbpedia.org/ontology/abstract&gt; '"Bank of
			America"' 1000).
			?proj &lt;http://dbpedia.org/ontology/owner&gt; ?const.
			}
			LIMIT 1
		</pseudoquery>
		<answers>
			<answer>http://dbpedia.org/resource/Bank_of_America_Plaza_(Dallas)
			</answer>
		</answers>
	</question>
	<question aggregation="false" answertype="resouce" hybrid="true"
		id="317" onlydbo="true">
		<string lang="en">Which buildings in art deco style did Shreve, Lamb
			and Harmon design?</string>
		<pseudoquery>PREFIX text:&lt;http://jena.apache.org/text#&gt;
			SELECT DISTINCT ?proj WHERE {
			?const text:query (&lt;http://dbpedia.org/ontology/abstract&gt; '"Lamb
			and"' 1000).
			?proj &lt;http://dbpedia.org/ontology/architect&gt; ?const.
			}
			LIMIT 12
		</pseudoquery>
		<answers>
			<answer>http://dbpedia.org/resource/245_Park_Avenue</answer>
			<answer>http://dbpedia.org/resource/Textron_Tower</answer>
			<answer>http://dbpedia.org/resource/Astral_Apartments</answer>
			<answer>http://dbpedia.org/resource/500_Fifth_Avenue</answer>
			<answer>http://dbpedia.org/resource/26_Broadway</answer>
			<answer>http://dbpedia.org/resource/Deutsche_Bank_Building</answer>
			<answer>http://dbpedia.org/resource/Empire_State_Building</answer>
			<answer>http://dbpedia.org/resource/Claremont_Opera_House</answer>
			<answer>http://dbpedia.org/resource/Sagamore_Hill_(house)</answer>
			<answer>http://dbpedia.org/resource/Hill_Building</answer>
			<answer>http://dbpedia.org/resource/1740_Broadway</answer>
			<answer>http://dbpedia.org/resource/Joel_W._Solomon_Federal_Building_and_United_States_Courthouse
			</answer>
		</answers>
	</question>
	<question aggregation="false" answertype="resouce" hybrid="true"
		id="318" onlydbo="true">
		<string lang="en">Which birds are protected under the National Parks
			and Wildlife Act?</string>
		<pseudoquery>PREFIX text:&lt;http://jena.apache.org/text#&gt;
			SELECT DISTINCT ?proj WHERE {
			?proj text:query (&lt;http://dbpedia.org/ontology/abstract&gt; '"National
			Parks and Wildlife Act"' 1000).
			?proj a &lt;http://dbpedia.org/ontology/Bird&gt;.
			}
			LIMIT 12
		</pseudoquery>
		<answers>
			<answer>http://dbpedia.org/resource/Black-faced_Cuckooshrike</answer>
			<answer>http://dbpedia.org/resource/Yellow_Thornbill</answer>
			<answer>http://dbpedia.org/resource/Bar-shouldered_Dove</answer>
			<answer>http://dbpedia.org/resource/Chestnut_Teal</answer>
			<answer>http://dbpedia.org/resource/Australian_Shelduck</answer>
			<answer>http://dbpedia.org/resource/Australasian_Shoveler</answer>
		</answers>
	</question>
	<question aggregation="false" answertype="resouce" hybrid="true"
		id="319" onlydbo="true">
		<string lang="en">Which country did the first known photographer of
			snowflakes come from?</string>
		<pseudoquery>PREFIX text:&lt;http://jena.apache.org/text#&gt;
			SELECT DISTINCT ?proj WHERE {
			?const text:query (&lt;http://dbpedia.org/ontology/abstract&gt; '"country"'
			1000).
			?proj &lt;http://dbpedia.org/ontology/birthPlace&gt; ?const.
			}
			LIMIT 12
		</pseudoquery>
		<answers>
			<answer>http://dbpedia.org/resource/Irakli_Abuseridze</answer>
			<answer>http://dbpedia.org/resource/Yakov_Dzhugashvili</answer>
			<answer>http://dbpedia.org/resource/Irakli_Labadze</answer>
			<answer>http://dbpedia.org/resource/Irakli_Logua</answer>
			<answer>http://dbpedia.org/resource/Oksana_Kalashnikova</answer>
			<answer>http://dbpedia.org/resource/Irakli_Klimiashvili</answer>
			<answer>http://dbpedia.org/resource/Irakli_Sirbiladze</answer>
			<answer>http://dbpedia.org/resource/Irakli_Alasania</answer>
			<answer>http://dbpedia.org/resource/Irakli_Chkhikvadze</answer>
			<answer>http://dbpedia.org/resource/Boris_Akunin</answer>
			<answer>http://dbpedia.org/resource/Irakli_Bagration_of_Mukhrani
			</answer>
			<answer>http://dbpedia.org/resource/Joseph_Jordania</answer>
		</answers>
	</question>
	<question aggregation="false" answertype="resouce" hybrid="true"
		id="320" onlydbo="true">
		<string lang="en">List all the battles commanded by the lover of
			Cleopatra.</string>
		<pseudoquery>PREFIX text:&lt;http://jena.apache.org/text#&gt;
			SELECT DISTINCT ?proj WHERE {
			?const text:query (&lt;http://dbpedia.org/ontology/abstract&gt; '"battles"'
			1000).
			?proj &lt;http://dbpedia.org/ontology/commander&gt; ?const.
			}
			LIMIT 12
		</pseudoquery>
		<answers>
			<answer>http://dbpedia.org/resource/Jacobite_rising_of_1715</answer>
			<answer>http://dbpedia.org/resource/Mughal-Rajput_War_(1525)</answer>
			<answer>http://dbpedia.org/resource/Battle_of_Sheriffmuir</answer>
		</answers>
	</question>
	<question aggregation="false" answertype="resouce" hybrid="true"
		id="322" onlydbo="true">
		<string lang="en">Which actress starring in the TV series Friends
			owns the production company Coquette Productions?</string>
		<pseudoquery>PREFIX text:&lt;http://jena.apache.org/text#&gt;
			SELECT DISTINCT ?proj WHERE {
			?const text:query (&lt;http://dbpedia.org/ontology/abstract&gt; '"Coquette
			Productions"' 1000).
			?proj &lt;http://dbpedia.org/ontology/starring&gt; ?const.
			}
			LIMIT 1
		</pseudoquery>
		<answers>
			<answer>http://dbpedia.org/resource/Cocoon:_The_Return</answer>
		</answers>
	</question>
	<question aggregation="false" answertype="resouce" hybrid="true"
		id="323" onlydbo="true">
		<string lang="en">Gaborone is the capital of which country member of
			the African Union?</string>
		<pseudoquery>PREFIX text:&lt;http://jena.apache.org/text#&gt;
			SELECT DISTINCT ?proj WHERE {
			?proj text:query (&lt;http://dbpedia.org/ontology/abstract&gt; '"country
			member" AND "African Union"' 1000).
			?proj ?pbridge &lt;http://dbpedia.org/resource/Gaborone&gt;.
			}
			LIMIT 1
		</pseudoquery>
		<answers>
			<answer>http://dbpedia.org/resource/Botswana</answer>
		</answers>
	</question>
	<question aggregation="false" answertype="resouce" hybrid="true"
		id="326" onlydbo="true">
		<string lang="en">For which movie did the daughter of Francis Ford
			Coppola receive an Oscar?</string>
		<pseudoquery>PREFIX text:&lt;http://jena.apache.org/text#&gt;
			SELECT DISTINCT ?proj WHERE {
			?proj text:query (&lt;http://dbpedia.org/ontology/abstract&gt; '"Francis
			Ford Coppola"' 1000).
			?proj a &lt;http://dbpedia.org/ontology/Film&gt;.
			}
			LIMIT 1
		</pseudoquery>
		<answers>
			<answer>http://dbpedia.org/resource/Filmmaker_(film)</answer>
		</answers>
	</question>
	<question aggregation="false" answertype="resouce" hybrid="true"
		id="328" onlydbo="true">
		<string lang="en">At which college did the only American actor that
			received the César Award study?</string>
		<pseudoquery>PREFIX text:&lt;http://jena.apache.org/text#&gt;
			SELECT DISTINCT ?proj WHERE {
			?proj text:query (&lt;http://dbpedia.org/ontology/abstract&gt; '"only
			American actor"' 1000).
			?const &lt;http://dbpedia.org/ontology/award&gt; ?proj.
			}
			LIMIT 1
		</pseudoquery>
		<answers>
			<answer>http://dbpedia.org/resource/Changeling_(film)</answer>
		</answers>
	</question>
	<question aggregation="false" answertype="resouce" hybrid="true"
		id="333" onlydbo="true">
		<string lang="en">In which city does the former main presenter of
			the Xposé girls live?</string>
		<pseudoquery>PREFIX text:&lt;http://jena.apache.org/text#&gt;
			SELECT DISTINCT ?proj WHERE {
			?const text:query (&lt;http://dbpedia.org/ontology/abstract&gt; '"former
			main presenter"' 1000).
			?const &lt;http://dbpedia.org/ontology/residence&gt; ?proj.
			}
			LIMIT 1
		</pseudoquery>
		<answers>
			<answer>http://dbpedia.org/resource/London</answer>
		</answers>
	</question>
	<question aggregation="false" answertype="resouce" hybrid="true"
		id="334" onlydbo="true">
		<string lang="en">Who plays Phileas Fogg in the adaptation of Around
			the World in 80 Days directed by Buzz Kulik?</string>
		<pseudoquery>PREFIX text:&lt;http://jena.apache.org/text#&gt;
			SELECT DISTINCT ?proj WHERE {
			?proj text:query (&lt;http://dbpedia.org/ontology/abstract&gt; '"Phileas
			Fogg"' 1000).
			?proj ?pbridge &lt;http://dbpedia.org/resource/Buzz_Kulik&gt;.
			}
			LIMIT 1
		</pseudoquery>
		<answers>
			<answer>http://dbpedia.org/resource/Around_the_World_in_80_Days_(TV_miniseries)
			</answer>
		</answers>
	</question>
	<question aggregation="false" answertype="resouce" hybrid="true"
		id="335" onlydbo="true">
		<string lang="en">Who is the front man of the band that wrote Coffee
			&amp; TV?</string>
		<pseudoquery>PREFIX text:&lt;http://jena.apache.org/text#&gt;
			SELECT DISTINCT ?proj WHERE {
			?proj text:query (&lt;http://dbpedia.org/ontology/abstract&gt; '"front
			man"' 1000).
			?const &lt;http://dbpedia.org/ontology/writer&gt; ?proj.
			}
			LIMIT 1
		</pseudoquery>
		<answers>
			<answer>http://dbpedia.org/resource/Mike_Herrera</answer>
		</answers>
	</question>
	<question aggregation="false" answertype="resouce" hybrid="true"
		id="340" onlydbo="true">
		<string lang="en">A landmark of which city is the home of the Mona
			Lisa?</string>
		<pseudoquery>PREFIX text:&lt;http://jena.apache.org/text#&gt;
			SELECT DISTINCT ?proj WHERE {
			?const text:query (&lt;http://dbpedia.org/ontology/abstract&gt; '"city"'
			1000).
			?const &lt;http://dbpedia.org/ontology/ground&gt; ?proj.
			}
			LIMIT 12
		</pseudoquery>
		<answers>
			<answer>http://dbpedia.org/resource/Etihad_Campus</answer>
			<answer>http://dbpedia.org/resource/Manchester</answer>
			<answer>http://dbpedia.org/resource/Bristol</answer>
			<answer>http://dbpedia.org/resource/City_of_Manchester_Stadium
			</answer>
			<answer>http://dbpedia.org/resource/Ashton_Gate_Stadium</answer>
		</answers>
	</question>
</dataset>
