{
  "dataset" : {
    "id" : "test"
  },
  "questions" : [ {
    "id" : "75",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the grandchildren of Elvis Presley."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Elvis_Presley>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Elvis_Presley>. ?v <http://dbpedia.org/ontology/producer> ?t . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/A_Little_Less_Conversation"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Don%27t_Be_Cruel"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Raised_on_Rock/For_Ol%27_Times_Sake"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Elvis_in_Concert_%28album%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Having_Fun_with_Elvis_on_Stage"
          }
        } ]
      }
    } ]
  }, {
    "id" : "172",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all members of Prodigy."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/associatedBand> <http://dbpedia.org/resource/The_Prodigy>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/The_Prodigy>. ?v <http://dbpedia.org/ontology/associatedBand> ?t . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Gizz_Butt"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/MINIM_%28band%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Sub_Focus"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ultramagnetic_MCs"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Shahin_Badar"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Liam_Howlett"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Crispian_Mills"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Arkarna"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Kool_Keith"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Keith_Flint"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Leeroy_Thornhill"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ping_Pong_Bitches"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Rob_Holliday"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Maxim_Reality"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Jim_Davies_%28musician%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Jentina"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Day_21"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Clockwork_Radio_%28band%29"
          }
        } ]
      }
    } ]
  }, {
    "id" : "185",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all gangsters from the prohibition era."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/The_Giver> <http://dbpedia.org/ontology/country> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/The_Giver>. ?t <http://dbpedia.org/ontology/country> ?v . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Education_in_the_United_States"
          }
        } ]
      }
    } ]
  }, {
    "id" : "187",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all chemical elements."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/Give_%28album%29> <http://dbpedia.org/ontology/recordedIn> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Give_%28album%29>. ?t <http://dbpedia.org/ontology/recordedIn> ?v . } ?v rdf:type <http://dbpedia.org/ontology/ChemicalElement> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Real_World_Studios"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Box,_Wiltshire"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/England"
          }
        } ]
      }
    } ]
  }, {
    "id" : "209",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Who killed Caesar?"
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/Operation_Caesar> <http://dbpedia.org/ontology/commander> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Operation_Caesar>. ?t <http://dbpedia.org/ontology/commander> ?v . } ?v rdf:type <http://dbpedia.org/ontology/Person> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Jimmy_Launders"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ralf-Reimar_Wolfram"
          }
        } ]
      }
    } ]
  } ]
}