{
  "dataset" : {
    "id" : "test"
  },
  "questions" : [ {
    "id" : "58",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List all episodes of the first season of the HBO television series The Sopranos."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s0 where { VALUES ?s0 { <http://dbpedia.org/resource/HBO> } } LIMIT 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/HBO"
          }
        } ]
      }
    } ]
  }, {
    "id" : "79",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all Canadian Grunge record labels."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 ?p1 <http://dbpedia.org/resource/Grunge> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/RecordLabel> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Sub_Pop"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Suicide_Squeeze_Records"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Cavity_Search_Records"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Avast!_Recording_Company"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Infinity_Cat_Recordings"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Murderecords"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/C/Z_Records"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Z-Man_Records"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/PopLlama_Records"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Cement_Shoes_Records"
          }
        } ]
      }
    } ]
  }, {
    "id" : "107",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the currency of China."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?o1 where { <http://dbpedia.org/resource/China> <http://dbpedia.org/ontology/currency> ?o1 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Renminbi"
          }
        } ]
      }
    } ]
  }, {
    "id" : "112",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me a list of all critically endangered birds."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 ?p1 <http://dbpedia.org/resource/Critically_endangered> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bird> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/List_of_parrots"
          }
        } ]
      }
    } ]
  }, {
    "id" : "149",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all Swedish oceanographers."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s0 where { VALUES ?s0 { <http://dbpedia.org/resource/Category:Swedish_oceanographers> } } LIMIT 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Category:Swedish_oceanographers"
          }
        } ]
      }
    } ]
  }, {
    "id" : "160",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all books by William Goldman with more than 300 pages."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman> . ?s1 <http://dbpedia.org/property/pages> ?o2 . FILTER( ?o2 >= \"300\"^^<http://www.w3.org/2001/XMLSchema#integer>). } LIMIT 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Marathon_Man_(novel)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Which_Lie_Did_I_Tell%3F"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Hype_and_Glory"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Tinsel_(novel)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Boys_and_Girls_Together"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Control_(novel)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Color_of_Light"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Princess_Bride"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Brothers_(Goldman_novel)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Wait_Till_Next_Year"
          }
        } ]
      }
    } ]
  }, {
    "id" : "165",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show me all books in Asimov's Foundation series."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?o1 where { <http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/author> ?o1 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Isaac_Asimov"
          }
        } ]
      }
    } ]
  }, {
    "id" : "185",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all gangsters from the prohibition era."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s0 where { VALUES ?s0 { <http://dbpedia.org/resource/Prohibition_in_the_United_States> } } LIMIT 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Prohibition_in_the_United_States"
          }
        } ]
      }
    } ]
  }, {
    "id" : "186",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all Seven Wonders of the Ancient World."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s0 where { VALUES ?s0 { <http://dbpedia.org/resource/Seven_Wonders_of_the_Ancient_World> } } LIMIT 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Seven_Wonders_of_the_Ancient_World"
          }
        } ]
      }
    } ]
  }, {
    "id" : "187",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all chemical elements."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s0 where { VALUES ?s0 { <http://dbpedia.org/resource/Chemical_element> } } LIMIT 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Chemical_element"
          }
        } ]
      }
    } ]
  }, {
    "id" : "209",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Who killed Caesar?"
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s0 where { VALUES ?s0 { <http://dbpedia.org/resource/Sid_Caesar> } } LIMIT 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Sid_Caesar"
          }
        } ]
      }
    } ]
  } ]
}