{
  "questions" : [ {
    "id" : "1",
    "answertype" : "resource",
    "question" : [ {
      "string" : "List all the musicals with music by Elton John.",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{ ?answer <http://dbpedia.org/ontology/musicComposer> <http://dbpedia.org/resource/Elton_John> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "literal" ]
      },
      "results" : {
        "bindings" : [ {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/The_Muse_(1999_film)"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Gnomeo_&_Juliet"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Elton_John:_Tantrums_&_Tiaras"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Billy_Elliot_the_Musical_Live"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Friends_(1971_film)"
          }
        } ]
      }
    } ]
  }, {
    "id" : "56",
    "answertype" : "list",
    "question" : [ {
      "string" : "Give me all launch pads operated by NASA.",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{ ?answer <http://dbpedia.org/ontology/numberOfPads> <http://dbpedia.org/resource/NASA> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "58",
    "answertype" : "resource",
    "question" : [ {
      "string" : "List all episodes of the first season of the HBO television series The Sopranos.",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{<http://dbpedia.org/resource/The_Sopranos> <http://dbpedia.org/ontology/numberOfEpisodes> ?answer . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "literal" ]
      },
      "results" : {
        "bindings" : [ {
          "literal" : {
            "type" : "literal",
            "value" : "86"
          }
        } ]
      }
    } ]
  }, {
    "id" : "59",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Who created Batman?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{ ?answer <http://dbpedia.org/ontology/created> <http://dbpedia.org/resource/Batman> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "66",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Give me all video games published by Mean Hamster Software.",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{ ?answer <http://dbpedia.org/ontology/olympicGamesWins> <http://dbpedia.org/resource/Mean_Hamster_Software> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "71",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Give me all movies directed by Francis Ford Coppola.",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{ ?answer <http://dbpedia.org/property/directed> <http://dbpedia.org/resource/Francis_Ford_Coppola> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "75",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Give me the grandchildren of Elvis Presley.",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{ ?answer <http://dbpedia.org/property/grandchildren> <http://dbpedia.org/resource/Elvis_Presley> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "79",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Give me all Canadian Grunge record labels.",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{ ?answer <http://dbpedia.org/property/labels> <http://dbpedia.org/resource/Grunge> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "81",
    "answertype" : "resource",
    "question" : [ {
      "string" : "List the children of Margaret Thatcher.",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{ ?answer <http://dbpedia.org/ontology/populationPctChildren> <http://dbpedia.org/resource/Margaret_Thatcher> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "86",
    "answertype" : "resource",
    "question" : [ {
      "string" : "List all games by GMT.",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{ ?answer <http://dbpedia.org/ontology/olympicGamesWins> <http://dbpedia.org/resource/Greenwich_Mean_Time> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "107",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Give me the currency of China.",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{<http://dbpedia.org/resource/China> <http://dbpedia.org/ontology/currency> ?answer . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "resource" ]
      },
      "results" : {
        "bindings" : [ {
          "resource" : {
            "type" : "resource",
            "value" : "http://dbpedia.org/resource/Renminbi"
          }
        } ]
      }
    } ]
  }, {
    "id" : "112",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Give me a list of all critically endangered birds.",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{ ?answer <http://dbpedia.org/ontology/redListIdNL> <http://dbpedia.org/resource/Critically_endangered> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "121",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Show me the book that Muhammad Ali wrote.",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{ ?answer <http://dbpedia.org/ontology/codeBook> <http://dbpedia.org/resource/Muhammad_Ali> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "124",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Give me all actors starring in Last Action Hero.",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{<http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> ?answer . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "literal" ]
      },
      "results" : {
        "bindings" : [ {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Anthony_Quinn"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Art_Carney"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/F._Murray_Abraham"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Frank_McRae"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Mercedes_Ruehl"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Austin_O'Brien"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Arnold_Schwarzenegger"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Charles_Dance"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Tom_Noonan"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Robert_Prosky"
          }
        } ]
      }
    } ]
  }, {
    "id" : "150",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Show me Hemingway's autobiography.",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{ ?answer <http://dbpedia.org/property/autobiography> <http://dbpedia.org/resource/Ernest_Hemingway> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "160",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Give me all books by William Goldman with more than 300 pages.",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{ ?answer <http://dbpedia.org/property/pages> <http://dbpedia.org/resource/William_Goldman> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "165",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Show me all books in Asimov's Foundation series.",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{<http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/books> ?answer . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "literal" ]
      },
      "results" : {
        "bindings" : [ {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Foundation's_Edge"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Foundation_and_Earth"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Prelude_to_Foundation"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Forward_the_Foundation"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Foundation_and_Empire"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Foundation_(Isaac_Asimov_novel)"
          }
        }, {
          "literal" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Second_Foundation"
          }
        } ]
      }
    } ]
  }, {
    "id" : "185",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Give me all gangsters from the prohibition era.",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{ ?answer <http://dbpedia.org/ontology/era> <http://dbpedia.org/resource/Prohibition_in_the_United_States> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "209",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Who killed Caesar?",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{ ?answer <http://dbpedia.org/ontology/killedBy> <http://dbpedia.org/resource/Julius_Caesar> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "empty" ]
      },
      "results" : {
        "bindings" : [ ]
      }
    } ]
  }, {
    "id" : "218",
    "answertype" : "resource",
    "question" : [ {
      "string" : "Give me the birth place of Frank Sinatra.",
      "language" : "en"
    } ],
    "query" : {
      "sparql" : "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> \nPREFIX dbp:  <http://dbpedia.org/property/> \nPREFIX dbo:  <http://dbpedia.org/ontology/> \nPREFIX    : <http://dbpedia.org/resource/>  \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\nPREFIX foaf: <http://xmlns.com/foaf/0.1/>\nSELECT ?answer WHERE{<http://dbpedia.org/resource/Frank_Sinatra> <http://dbpedia.org/ontology/birthPlace> ?answer . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "resource" ]
      },
      "results" : {
        "bindings" : [ {
          "resource" : {
            "type" : "resource",
            "value" : "http://dbpedia.org/resource/Hoboken,_New_Jersey"
          }
        } ]
      }
    } ]
  } ]
}