{
  "dataset" : {
    "id" : "test"
  },
  "questions" : [ {
    "id" : "1",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List all boardgames by GMT."
    } ],
    "query" : { },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : { }
    } ]
  }, {
    "id" : "87",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Who created Goofy?"
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?u_0 WHERE { ?u_0 <http://dbpedia.org/ontology/relative> <http://dbpedia.org/resource/Goofy> }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Max_Goof"
          }
        } ]
      }
    } ]
  }, {
    "id" : "96",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List all the musicals with music by Leonard Bernstein."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?u_0 WHERE { ?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical> .?u_0 <http://dbpedia.org/ontology/lyrics> <http://dbpedia.org/resource/Leonard_Bernstein> }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Candide_(operetta)"
          }
        } ]
      }
    } ]
  }, {
    "id" : "178",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List the seven kings of Rome."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?u_0 WHERE { <http://dbpedia.org/resource/Rome> <http://dbpedia.org/ontology/country> ?u_0 }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Italy"
          }
        } ]
      }
    } ]
  }, {
    "id" : "249",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List all the musicals with music by Elton John."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?u_0 WHERE { ?u_0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical> .?u_0 <http://dbpedia.org/ontology/lyrics> <http://dbpedia.org/resource/Ben_Elton> }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Beautiful_Game_(musical)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/We_Will_Rock_You_(musical)"
          }
        } ]
      }
    } ]
  }, {
    "id" : "275",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List the children of Margaret Thatcher."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?u_0 WHERE { ?u_0 <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Margaret_Thatcher> }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Alfred_Roberts"
          }
        } ]
      }
    } ]
  } ]
}