{
  "dataset" : {
    "id" : "test"
  },
  "questions" : [ {
    "id" : "118",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all Methodist politicians."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Methodism>. ?v <http://dbpedia.org/ontology/religion> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Politician> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Winthrop_Rockefeller"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Harold_Washington"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Pat_Roberts"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Canaan_Banana"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Max_Cleland"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Robert_Marion_Berry"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Chiang_Kai-shek"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bob_Barr"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Syngman_Rhee"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/William_F._Knowland"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Debbie_Stabenow"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Heather_Wilson"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Keith_Harvey_Miller"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/William_McKinley"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Jay_Hammond"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Terry_Sanford"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/George_S._Mickelson"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/John_Tower"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Chiang_Ching-kuo"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lurleen_Wallace"
          }
        } ]
      }
    } ]
  }, {
    "id" : "136",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show me all songs from Bruce Springsteen released between 1980 and 1990."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/Bruce_Springsteen> <http://dbpedia.org/ontology/genre> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Bruce_Springsteen>. ?t <http://dbpedia.org/ontology/genre> ?v . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Rock_music"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Folk_rock"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Heartland_rock"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Roots_rock"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Hard_rock"
          }
        } ]
      }
    } ]
  }, {
    "id" : "141",
    "answertype" : "date",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the birthdays of all actors of the television show Charmed."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Charmed>. ?t <http://dbpedia.org/ontology/starring> ?v . } ?v rdf:type <http://dbpedia.org/ontology/Actor> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "date" ]
      },
      "results" : {
        "bindings" : [ {
          "date" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Greg_Vaughan"
          }
        } ]
      }
    } ]
  }, {
    "id" : "143",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me a list of all lakes in Denmark."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Denmark>. ?v <http://dbpedia.org/ontology/country> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Lake> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/B%C3%B8lling_lake"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Fures%C3%B8_%28lake%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Lakes,_Copenhagen"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lake_Bagsv%C3%A6rd"
          }
        } ]
      }
    } ]
  }, {
    "id" : "145",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show me all English Gothic buildings in Kent."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/architecturalStyle> <http://dbpedia.org/resource/English_Gothic_architecture>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/English_Gothic_architecture>. ?v <http://dbpedia.org/ontology/architecturalStyle> ?t . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Mary%27s_Church,_Ulverston"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Augustine%27s_Church,_Norwich"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Wilfrid%27s_Church,_Grappenhall"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/University_Church_of_St_Mary_the_Virgin"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/All_Saints_Church,_Aldwincle"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Gabriel%27s,_Warwick_Square"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/All_Saints_Church,_Kedleston"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Mary_and_St_Abraam_Coptic_Orthodox_Church,_Hove"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Old_St_Peter_and_St_Paul%27s_Church,_Albury"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Nicholas%27_Church,_Gloucester"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Old_St_Andrew%27s_Church,_Kingsbury"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Peter%27s_Church,_Sudbury"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/All_Saints%27_Church,_Harewood"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Saviour,_Pimlico"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Peter%27s_Church,_Sandwich"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Duiske_Abbey"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Church_of_St_John_Maddermarket"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Peter%27s_Church,_Prestbury"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Hollywood_United_Methodist_Church"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Mary%27s_Church,_Sandwich"
          }
        } ]
      }
    } ]
  }, {
    "id" : "158",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List all episodes of the first season of the HBO television series The Sopranos!"
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/company> <http://dbpedia.org/resource/HBO>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/HBO>. ?v <http://dbpedia.org/ontology/company> ?t . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Everybody_Loves_Raymond"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Dr._Katz,_Professional_Therapist"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Capadocia_%28TV_series%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Larry_Sanders_Show"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Unscripted"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Boardwalk_Empire"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Angry_Boys"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Run,_Buddy,_Run"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Hotel_Erotica"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Transporter:_The_Series"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Game_of_Thrones"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Martin_%28TV_series%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Tales_from_the_Crypt_%28TV_series%29"
          }
        } ]
      }
    } ]
  }, {
    "id" : "161",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all films produced by Hal Roach."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Hal_Roach>. ?v <http://dbpedia.org/ontology/producer> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Film> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Sugar_Daddies"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Another_Fine_Mess"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Babes_in_Toyland_%281934_film%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Captain_Fury"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/One_Million_B.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/45_Minutes_from_Hollywood"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Merrily_We_Live"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Fish_Hooky"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Way_Out_West_%281937_film%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Finishing_Touch"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Thicker_than_Water_%281935_film%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Topper_%28film%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Grandma%27s_Boy_%281922_film%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Should_Sailors_Marry%3F"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Your_Own_Back_Yard"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mary,_Queen_of_Tots"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Isn%27t_Life_Terrible%3F"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Marathon"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Arbor_Day_%28film%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Turnabout_%28film%29"
          }
        } ]
      }
    } ]
  }, {
    "id" : "164",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me a list of all bandleaders that play trumpet."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/The_Giver> <http://dbpedia.org/ontology/publisher> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/The_Giver>. ?t <http://dbpedia.org/ontology/publisher> ?v . } ?v rdf:type <http://dbpedia.org/ontology/Play> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bantam_Books"
          }
        } ]
      }
    } ]
  }, {
    "id" : "171",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all movies with Tom Cruise."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/narrator> <http://dbpedia.org/resource/Tom_Cruise>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Tom_Cruise>. ?v <http://dbpedia.org/ontology/narrator> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Film> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Stanley_Kubrick:_A_Life_in_Pictures"
          }
        } ]
      }
    } ]
  }, {
    "id" : "173",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all cities in New Jersey with more than 100000 inhabitants."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/New_Jersey> <http://dbpedia.org/ontology/capital> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/New_Jersey>. ?t <http://dbpedia.org/ontology/capital> ?v . } ?v rdf:type <http://dbpedia.org/ontology/City> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Trenton,_New_Jersey"
          }
        } ]
      }
    } ]
  }, {
    "id" : "175",
    "answertype" : "string",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all B-sides of the Ramones."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/Ramones> <http://dbpedia.org/ontology/associatedBand> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Ramones>. ?t <http://dbpedia.org/ontology/associatedBand> ?v . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "string" ]
      },
      "results" : {
        "bindings" : [ {
          "string" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Dust_%28band%29"
          }
        }, {
          "string" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Osaka_Popstar"
          }
        }, {
          "string" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Los_Gusanos"
          }
        }, {
          "string" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Sniper_%28American_band%29"
          }
        }, {
          "string" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Uncle_Monk"
          }
        }, {
          "string" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Misfits_%28band%29"
          }
        }, {
          "string" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/The_Voidoids"
          }
        }, {
          "string" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Blondie_%28band%29"
          }
        } ]
      }
    } ]
  }, {
    "id" : "178",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List the seven kings of Rome."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Rome>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Rome>. ?v <http://dbpedia.org/ontology/award> ?t . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lee_Bontecou"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Raffaele_Frumenti"
          }
        } ]
      }
    } ]
  }, {
    "id" : "179",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all people that were born in Vienna and died in Berlin."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/region> <http://dbpedia.org/resource/Vienna>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Vienna>. ?v <http://dbpedia.org/ontology/region> ?t . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Dagmar_Belakowitsch-Jenewein"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Vienna_Woods"
          }
        } ]
      }
    } ]
  }, {
    "id" : "181",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show me all the breweries in Australia."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/distributor> <http://dbpedia.org/resource/Australia>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Australia>. ?v <http://dbpedia.org/ontology/distributor> ?t . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Fear%28s%29_of_the_Dark"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Eternal_Sonata"
          }
        } ]
      }
    } ]
  }, {
    "id" : "182",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all films produced by Steven Spielberg with a budget of at least $80 million."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/cinematography> <http://dbpedia.org/resource/Steven_Spielberg>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Steven_Spielberg>. ?v <http://dbpedia.org/ontology/cinematography> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Film> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Firelight_%281964_film%29"
          }
        } ]
      }
    } ]
  }, {
    "id" : "183",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all soccer clubs in Spain."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/ground> <http://dbpedia.org/resource/Spain>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Spain>. ?v <http://dbpedia.org/ontology/ground> ?t . } ?v rdf:type <http://dbpedia.org/ontology/SoccerClub> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Recreativo_de_Huelva"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Sevilla_FC"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/H%C3%A9rcules_CF"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/UE_Sant_Andreu"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Real_Uni%C3%B3n"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Real_Betis"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/M%C3%A1laga_CF"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/UD_Almer%C3%ADa"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Racing_de_Santander"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Alicante_CF"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/C%C3%A1diz_CF"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Atl%C3%A9tico_Madrid"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/RCD_Espanyol"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/CA_Osasuna"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/BM_Ciudad_de_Almer%C3%ADa"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/CE_Europa"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Real_Sociedad"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Villarreal_CF"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Xerez_CD"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/C%C3%B3rdoba_CF"
          }
        } ]
      }
    } ]
  }, {
    "id" : "193",
    "answertype" : "boolean",
    "question" : [ {
      "language" : "en",
      "string" : "Is Cola a beverage?"
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/hasVariant> <http://dbpedia.org/resource/Cola>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Cola>. ?v <http://dbpedia.org/ontology/hasVariant> ?t . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : { },
      "results" : { },
      "boolean" : false
    } ]
  }, {
    "id" : "210",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Who created Batman?"
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Batman>. ?t <http://dbpedia.org/ontology/creator> ?v . } ?v rdf:type <http://dbpedia.org/ontology/Person> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bill_Finger"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bob_Kane"
          }
        } ]
      }
    } ]
  } ]
}