{
  "dataset" : {
    "id" : "test"
  },
  "questions" : [ {
    "id" : "59",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all islands that belong to Japan."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Japan>. ?v <http://dbpedia.org/ontology/country> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Island> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Iwo_Jima"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Rishiri_Island"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Rebun_Island"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Kyushu"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ryukyu_Islands"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Minamitorishima"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Miyako-jima"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ishigaki_Island"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Okinotorishima"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Kerama_Islands"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Tsushima_Island"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Nakanoshima_%28Kagoshima%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Kamome_Island"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Honshu"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Torishima_%28Izu_Islands%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Amami_%C5%8Cshima"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Awaji_Island"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Okushiri_Island"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Okinawa_Island"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Hashima_Island"
          }
        } ]
      }
    } ]
  }, {
    "id" : "64",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all soccer clubs in the Premier League."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Premier_League>. ?v <http://dbpedia.org/ontology/league> ?t . } ?v rdf:type <http://dbpedia.org/ontology/SoccerClub> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Aston_Villa_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Sunderland_A.F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Wolverhampton_Wanderers_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Stoke_City_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Newcastle_United_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Blackburn_Rovers_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Queens_Park_Rangers_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Manchester_City_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Manchester_United_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Wigan_Athletic_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/West_Bromwich_Albion_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Arsenal_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Norwich_City_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Everton_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Fulham_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Chelsea_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Liverpool_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bolton_Wanderers_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Tottenham_Hotspur_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Swansea_City_A.F.C."
          }
        } ]
      }
    } ]
  }, {
    "id" : "69",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all actors who were born in Paris after 1950."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Paris>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Paris>. ?v <http://dbpedia.org/ontology/birthPlace> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Actor> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Janine_Sutto"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Georges_M%C3%A9li%C3%A8s"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Guy_Marchand"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Maurice_Dorl%C3%A9ac"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Pitof"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ludmilla_Tch%C3%A9rina"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Patrick_Braoud%C3%A9"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/%C3%89lisabeth_Depardieu"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bretaigne_Windust"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Jean-Pierre_Melville"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Claude_Renoir"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Pierre_Renoir"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Maurice_Tourneur"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Louis_J._Gasnier"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Fran%C3%A7ois_P%C3%A9rier"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Isabelle_Carr%C3%A9"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Claude_Miller"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Fabrice_Luchini"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Pierre_Boulanger"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bunny_Breckinridge"
          }
        } ]
      }
    } ]
  }, {
    "id" : "71",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all Australian nonprofit organizations."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Australians>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Australians>. ?v <http://dbpedia.org/ontology/country> ?t . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Nat_Thomson"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Monster_Blood_Tattoo_Book_One:_Foundling"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Harry_Boyle"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Violet_Keystone"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bert_Ironmonger"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Sammy_Jones"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Grass_Roots_%28TV_series%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lady_Friday"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Peter_Burge_%28cricketer%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Aenir"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Syrup_%28novel%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Alick_Bannerman"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Francis_Matthew_John_Baker"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Tibby_Cotter"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Above_the_Veil"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Shade%27s_Children"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Keith_Slater"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Into_Battle"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Jack_Lyons_%28cricketer%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bert_Hopkins"
          }
        } ]
      }
    } ]
  }, {
    "id" : "73",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all ESA astronauts."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/manufacturer> <http://dbpedia.org/resource/European_Space_Agency>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/European_Space_Agency>. ?v <http://dbpedia.org/ontology/manufacturer> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Astronaut> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Vega_%28rocket%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ariane_1"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ariane_5"
          }
        } ]
      }
    } ]
  }, {
    "id" : "78",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all federal chancellors of Germany."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Germany>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Germany>. ?v <http://dbpedia.org/ontology/birthPlace> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Chancellor> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Gerhard_Schr%C3%B6der"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Willi_Schatz"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Wilhelm_Boger"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Franz_H%C3%B6ssler"
          }
        } ]
      }
    } ]
  }, {
    "id" : "79",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show me everyone who was born on Halloween."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/Halloween> <http://dbpedia.org/ontology/country> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Halloween>. ?t <http://dbpedia.org/ontology/country> ?v . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Halloween_around_the_world"
          }
        } ]
      }
    } ]
  }, {
    "id" : "86",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all actors who were born in Berlin."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Berlin>. ?v <http://dbpedia.org/ontology/birthPlace> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Actor> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Henry_H%C3%BCbchen"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Henry_Blanke"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Henry_Brandon_%28actor%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Wolfgang_Kohlhaase"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Katharine_Cornell"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Shaghayegh_Dehghan"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/J%C3%B6rg_Buttgereit"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Erwin_Hillier"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Erik_Ode"
          }
        } ]
      }
    } ]
  }, {
    "id" : "87",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Who created Goofy?"
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/Goofy> <http://dbpedia.org/ontology/relative> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Goofy>. ?t <http://dbpedia.org/ontology/relative> ?v . } ?v rdf:type <http://dbpedia.org/ontology/Person> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Max_Goof"
          }
        } ]
      }
    } ]
  }, {
    "id" : "91",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all the TV shows with Neil Patrick Harris."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Neil_Patrick_Harris>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Neil_Patrick_Harris>. ?v <http://dbpedia.org/ontology/director> ?t . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Jenkins_%28How_I_Met_Your_Mother%29"
          }
        } ]
      }
    } ]
  }, {
    "id" : "96",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List all the musicals with music by Leonard Bernstein."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Leonard_Bernstein>. ?v <http://dbpedia.org/ontology/musicBy> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Musical> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Wonderful_Town"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Race_to_Urga"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/On_the_Town_%28musical%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/West_Side_Story"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/A_Party_with_Betty_Comden_and_Adolph_Green"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/1600_Pennsylvania_Avenue_%28musical%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Side_by_Side_by_Sondheim"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Candide_%28operetta%29"
          }
        } ]
      }
    } ]
  }, {
    "id" : "101",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all Australian metalcore bands."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/citizenship> <http://dbpedia.org/resource/Australians>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Australians>. ?v <http://dbpedia.org/ontology/citizenship> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Band> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Michael_Denton"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Edwin_Cheel"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Poh_Ling_Yeow"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Charles_Moore_%28botanist%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Moira_Kelly_%28humanitarian%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Sohail_Inayatullah"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Nick_Martin"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/John_Green_%28botanist%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Valery_Troitskaya"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bernard_Hyland"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/John_S._Clark"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Estate_V._Khmaladze"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Alexander_Floyd"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lindsay_Armstrong"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Aravind_Adiga"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ursula_McConnel"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Jennifer_Gidley"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Madhan_Karky"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lucy_Christopher"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/William_Blakely"
          }
        } ]
      }
    } ]
  }, {
    "id" : "103",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all types of eating disorders."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/Give_%28album%29> <http://dbpedia.org/ontology/type> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Give_%28album%29>. ?t <http://dbpedia.org/ontology/type> ?v . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Album"
          }
        } ]
      }
    } ]
  }, {
    "id" : "109",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all books written by Danielle Steel."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Danielle_Steel>. ?v <http://dbpedia.org/ontology/author> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Book> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Southern_Lights_%28novel%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/One_Day_at_a_Time_%28novel%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bungalow_2_%28novel%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Echoes_%28novel%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/H.R.H._%28novel%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Impossible_%28novel%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Amazing_Grace_%28novel%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Honor_Thyself"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Toxic_Bachelors_%28novel%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/A_Perfect_Stranger"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Legacy_%282010_novel%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Big_Girl_%28novel%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Miracle_%28novel%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_House_%28novel%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Family_Ties_%28novel%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/A_Good_Woman_%28novel%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Rogue_%28novel%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Sisters_%28Steel_novel%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Matters_of_the_Heart_%28novel%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Coming_Out_%28novel%29"
          }
        } ]
      }
    } ]
  } ]
}