{
  "dataset" : {
    "id" : "test"
  },
  "questions" : [ {
    "id" : "1",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List all boardgames by GMT."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/related> <http://dbpedia.org/resource/Greenwich_Mean_Time>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Greenwich_Mean_Time>. ?v <http://dbpedia.org/ontology/related> ?t . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/World:_Have_Your_Say"
          }
        } ]
      }
    } ]
  }, {
    "id" : "9",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all actors starring in movies directed by and starring William Shatner."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/William_Shatner>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/William_Shatner>. ?v <http://dbpedia.org/ontology/starring> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Actor> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Incubus_%281966_film%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Tenth_Level"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/%24h*%21_My_Dad_Says"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Devil%27s_Rain"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Kidnapping_of_the_President"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Airplane_II:_The_Sequel"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Star_Trek:_Phase_II"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Miss_Congeniality_%28film%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Over_the_Hedge_%28film%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Loaded_Weapon_1"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Free_Enterprise_%28film%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Osmosis_Jones"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Barbary_Coast_%28TV_series%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Showtime_%28film%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/William_Shatner%27s_Gonzo_Ballet"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Star_Trek:_The_Original_Series"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Outrage"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Invasion_Iowa"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Boston_Legal"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/T._J._Hooker"
          }
        } ]
      }
    } ]
  }, {
    "id" : "11",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all Danish films."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/language> <http://dbpedia.org/resource/Danish_language>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Danish_language>. ?v <http://dbpedia.org/ontology/language> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Film> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Island_at_the_Top_of_the_World"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Eye_of_the_Eagle_%28film%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Hamsun_%28film%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/H%C3%A4xan"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Gertrud_%28film%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Der_var_engang_en_vicev%C3%A6rt"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Perfect_Human"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Boss_of_It_All"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Journals_of_Knud_Rasmussen"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Tintin_and_I"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Barbara_%28film%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Arn_%E2%80%93_The_Kingdom_at_Road%27s_End"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Valhalla_%28film%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Adam%27s_Apples"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Five_Obstructions"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Himmelskibet_%28film%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Frk._M%C3%B8llers_jubil%C3%A6um"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Busters_verden"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ordet"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Hagbard_and_Signe"
          }
        } ]
      }
    } ]
  }, {
    "id" : "13",
    "answertype" : "number",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the grandchildren of Bruce Lee."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Bruce_Lee>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Bruce_Lee>. ?v <http://dbpedia.org/ontology/director> ?t . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "c" ]
      },
      "results" : {
        "bindings" : [ {
          "c" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Bruce_Lee:_A_Warrior%27s_Journey"
          }
        } ]
      }
    } ]
  }, {
    "id" : "20",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the Apollo 14 astronauts."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Apollo_14>. ?v <http://dbpedia.org/ontology/mission> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Astronaut> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Stuart_Roosa"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Alan_Shepard"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Edgar_Mitchell"
          }
        } ]
      }
    } ]
  }, {
    "id" : "24",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me a list of all trumpet players that were bandleaders."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/foundationPlace> <http://dbpedia.org/resource/Give_%28Denmark%29>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Give_%28Denmark%29>. ?v <http://dbpedia.org/ontology/foundationPlace> ?t . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Nordex"
          }
        } ]
      }
    } ]
  }, {
    "id" : "29",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show me all museums in London."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/broadcastArea> <http://dbpedia.org/resource/London>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/London>. ?v <http://dbpedia.org/ontology/broadcastArea> ?t . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Absolute_Xtreme"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/LBC_News_1152"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Real_Radio_Digital"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Kiss_100_London"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Capital_FM_Network"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Virgin_Radio_Groove"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/BBC_Two"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Heart_Network"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Absolute_Radio"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/London_Greek_Radio"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Gold_%28radio%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Melody_105.4_FM"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/LBC_97.3"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Hit_Music_Network"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Colourful_Radio"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Country_1035"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Magic_105.4_FM"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Q_%28radio_station%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/CBBC"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/XFM_London"
          }
        } ]
      }
    } ]
  }, {
    "id" : "33",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all writers that won the Nobel Prize in literature."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Nobel_Prize_in_Literature>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Nobel_Prize_in_Literature>. ?v <http://dbpedia.org/ontology/award> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Writer> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Czes%C5%82aw_Mi%C5%82osz"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/T._S._Eliot"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ernest_Hemingway"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Naguib_Mahfouz"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Juan_Ram%C3%B3n_Jim%C3%A9nez"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/William_Faulkner"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Harold_Pinter"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ivo_Andri%C4%87"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Eugene_O%27Neill"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Seamus_Heaney"
          }
        } ]
      }
    } ]
  }, {
    "id" : "40",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give all swimmers that were born in Moscow."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Moscow>. ?v <http://dbpedia.org/ontology/birthPlace> ?t . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Peter_Kropotkin"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Alex_Bogomolov,_Jr."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Boris_Barnet"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Alexander_Herzen"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bulat_Okudzhava"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Anatoly_Khazanov"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Fyodor_Dostoyevsky"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Paul_Sheriff"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Pavel_Bure"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Valeri_Kharlamov"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Leonid_Derbenyov"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Natalya_Bondarchuk"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Sergey_Mikhalkov"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Boris_Leven"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Eudoxia_Lopukhina"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Andrei_Voznesensky"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Andrei_Konchalovsky"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Andrey_Korotayev"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mikhail_Kasyanov"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Olga_Seryabkina"
          }
        } ]
      }
    } ]
  }, {
    "id" : "41",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all cosmonauts."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/Give_%28album%29> <http://dbpedia.org/ontology/artist> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Give_%28album%29>. ?t <http://dbpedia.org/ontology/artist> ?v . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Bad_Plus"
          }
        } ]
      }
    } ]
  }, {
    "id" : "42",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all Swiss non-profit organizations."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Switzerland>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Switzerland>. ?v <http://dbpedia.org/ontology/location> ?t . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lake_Constance"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Oriflame"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Gate_Gourmet"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Syngenta"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Zurich_Financial_Services"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Kunsthaus_Z%C3%BCrich"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St._Jakob-Park"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/International_Union_for_Conservation_of_Nature"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Intercity-Express"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Novartis"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/International_Basketball_Federation"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Locarno_International_Film_Festival"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Beyeler_Foundation"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Glencore"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lake_Maggiore"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Grosser_Preis_des_Kantons_Aargau"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Vitra_%28furniture%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bank_for_International_Settlements"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/International_Red_Cross_and_Red_Crescent_Movement"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Kunstmuseum_Basel"
          }
        } ]
      }
    } ]
  }, {
    "id" : "46",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show a list of soccer clubs that play in the Bundesliga."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Basketball_Bundesliga>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Basketball_Bundesliga>. ?v <http://dbpedia.org/ontology/league> ?t . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Kyle_Weaver"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Jan_Jagla"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Siim-Sander_Vene"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Andre_McGee"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ben_Hansbrough"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Drew_Neitzel"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Vincent_Yarbrough"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Kenny_Hasbrouck"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Johannes_Herber"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Chris_Moss"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/DaShaun_Wood"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Robin_Smeulders"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ekene_Ibekwe"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Casey_Jacobsen"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mindaugas_Lukauskis"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lee_Humphrey"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Blagota_Sekuli%C4%87"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Terrell_Everett"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ansu_Sesay"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Tadija_Dragi%C4%87evi%C4%87"
          }
        } ]
      }
    } ]
  }, {
    "id" : "54",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all companies in Munich."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/subsidiary> <http://dbpedia.org/resource/Munich>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Munich>. ?v <http://dbpedia.org/ontology/subsidiary> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Company> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/ICharts"
          }
        } ]
      }
    } ]
  }, {
    "id" : "55",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the capitals of all countries that the Himalayas run through."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Himalayas>. ?t <http://dbpedia.org/ontology/country> ?v . } ?v rdf:type <http://dbpedia.org/ontology/Country> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Pakistan"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/India"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bhutan"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Afghanistan"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/People%27s_Republic_of_China"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Nepal"
          }
        } ]
      }
    } ]
  } ]
}