{
  "dataset" : {
    "id" : "test"
  },
  "questions" : [ {
    "id" : "213",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all movies directed by Francis Ford Coppola."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/editing> <http://dbpedia.org/resource/Francis_Ford_Coppola>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Francis_Ford_Coppola>. ?v <http://dbpedia.org/ontology/editing> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Film> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Supernova_%282000_film%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Legend_of_Suriyothai"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Fantasticks_%28film%29"
          }
        } ]
      }
    } ]
  }, {
    "id" : "231",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all launch pads operated by NASA."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/NASA>. ?v <http://dbpedia.org/ontology/operator> ?t . } ?v rdf:type <http://dbpedia.org/ontology/LaunchPad> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Cape_Canaveral_Air_Force_Station_Space_Launch_Complex_17"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mid-Atlantic_Regional_Spaceport_Launch_Pad_0"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Spaceport_Florida_Launch_Complex_36"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Cape_Canaveral_Air_Force_Station_Launch_Complex_18"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Wallops_Flight_Facility_Launch_Area_3"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Broglio_Space_Centre"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Cape_Canaveral_Air_Force_Station_Launch_Complex_13"
          }
        } ]
      }
    } ]
  }, {
    "id" : "249",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List all the musicals with music by Elton John."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Elton_John>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Elton_John>. ?v <http://dbpedia.org/ontology/musicBy> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Musical> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Aida_%28musical%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Billy_Elliot_the_Musical"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lestat_%28musical%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Lion_King_%28musical%29"
          }
        } ]
      }
    } ]
  }, {
    "id" : "260",
    "answertype" : "number",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the runtime of Toy Story."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/ontology/runtime> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Toy_Story>. ?t <http://dbpedia.org/ontology/runtime> ?v . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "c" ]
      },
      "results" : {
        "bindings" : [ {
          "c" : {
            "type" : "literal",
            "value" : "4800.0"
          }
        } ]
      }
    } ]
  }, {
    "id" : "275",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List the children of Margaret Thatcher."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/child> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Margaret_Thatcher>. ?t <http://dbpedia.org/ontology/child> ?v . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Carol_Thatcher"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mark_Thatcher"
          }
        } ]
      }
    } ]
  }, {
    "id" : "295",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all video games published by Mean Hamster Software."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/Mean_Hamster_Software>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Mean_Hamster_Software>. ?v <http://dbpedia.org/ontology/publisher> ?t . } ?v rdf:type <http://dbpedia.org/ontology/VideoGame> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Myst"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Crossbow_%28video_game%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Riven"
          }
        } ]
      }
    } ]
  }, {
    "id" : "296",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all members of Prodigy."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/Prodigy_%28rapper%29> <http://dbpedia.org/ontology/associatedMusicalArtist> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Prodigy_%28rapper%29>. ?t <http://dbpedia.org/ontology/associatedMusicalArtist> ?v . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mobb_Deep"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Nas"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/G-Unit"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Infamous_Mobb"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Big_Noyd"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Alchemist_%28producer%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Havoc_%28Mobb_Deep%29"
          }
        } ]
      }
    } ]
  }, {
    "id" : "305",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Which holidays are celebrated around the world? test2"
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/Which%3F> <http://dbpedia.org/ontology/language> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Which%3F>. ?t <http://dbpedia.org/ontology/language> ?v . } ?v rdf:type <http://dbpedia.org/ontology/Holiday> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/English_language"
          }
        } ]
      }
    } ]
  }, {
    "id" : "313",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the birth place of Frank Sinatra."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/Frank_Sinatra> <http://dbpedia.org/ontology/birthDate> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Frank_Sinatra>. ?t <http://dbpedia.org/ontology/birthDate> ?v . } ?v rdf:type <http://dbpedia.org/ontology/Place> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "1915-12-12"
          }
        } ]
      }
    } ]
  }, {
    "id" : "367",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the grandchildren of Elvis Presley."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/Elvis_Presley> <http://dbpedia.org/ontology/associatedMusicalArtist> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Elvis_Presley>. ?t <http://dbpedia.org/ontology/associatedMusicalArtist> ?v . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Imperials"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Blue_Moon_Boys"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Jordanaires"
          }
        } ]
      }
    } ]
  }, {
    "id" : "371",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all books by William Goldman with more than 300 pages."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/William_Goldman> <http://dbpedia.org/ontology/influencedBy> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/William_Goldman>. ?t <http://dbpedia.org/ontology/influencedBy> ?v . } ?v rdf:type <http://dbpedia.org/ontology/Book> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Irwin_Shaw"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ingmar_Bergman"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/F._Scott_Fitzgerald"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ross_Macdonald"
          }
        } ]
      }
    } ]
  }, {
    "id" : "383",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show me the book that Muhammad Ali wrote."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Muhammad_Ali>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Muhammad_Ali>. ?v <http://dbpedia.org/ontology/author> ?t . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Soul_of_a_Butterfly"
          }
        } ]
      }
    } ]
  }, {
    "id" : "394",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all Canadian Grunge record labels."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/genre> <http://dbpedia.org/resource/Grunge>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Grunge>. ?v <http://dbpedia.org/ontology/genre> ?t . } ?v rdf:type <http://dbpedia.org/ontology/RecordLabel> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Sub_Pop"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Murderecords"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/C/Z_Records"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Cement_Shoes_Records"
          }
        } ]
      }
    } ]
  }, {
    "id" : "402",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the currency of China."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/headquarter> <http://dbpedia.org/resource/China>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/China>. ?v <http://dbpedia.org/ontology/headquarter> ?t . } ?v rdf:type <http://dbpedia.org/ontology/Currency> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Cable_&_Satellite_Broadcasting_Association_of_Asia"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Jun_He_Law_Offices"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Social_Security_Fund"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/CNC_World"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Commerce_&_Finance_Law_Offices"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Chinese_Chess_Association"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Grandstar_Cargo"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Fangda_Partners"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/WEMUN_Expo"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/International_Wushu_Federation"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Haiwen_&_Partners"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Northeast_Airlines_%28China%29"
          }
        } ]
      }
    } ]
  }, {
    "id" : "403",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all Swedish oceanographers."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { ?v <http://dbpedia.org/ontology/language> <http://dbpedia.org/resource/Swedish_language>. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Swedish_language>. ?v <http://dbpedia.org/ontology/language> ?t . } OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Astrid_Lindgren"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Island_at_the_Top_of_the_World"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/%C3%85land_Islands"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/European_Environment_Agency"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Guinness_World_Records"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Don_Juan,_or_If_Don_Juan_Were_a_Woman"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Sweden"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Emigrants_%28novels%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Independent_Media_Center"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Aftonbladet"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Finland"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Sacrifice"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Dagens_Nyheter"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Fernando_%28song%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Girl_Who_Kicked_the_Hornets%27_Nest"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mio_in_the_Land_of_Faraway"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/You,_the_Living"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Donkey_Kong_Country_%28TV_series%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Wild_Strawberries_%28film%29"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Girl_Who_Played_with_Fire"
          }
        } ]
      }
    } ]
  }, {
    "id" : "412",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all actors starring in Last Action Hero."
    } ],
    "query" : {
      "sparql" : "select distinct * where { graph ?g { { <http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> ?v. } Union { ?t owl:sameAs <http://dbpedia.org/resource/Last_Action_Hero>. ?t <http://dbpedia.org/ontology/starring> ?v . } ?v rdf:type <http://dbpedia.org/ontology/Actor> . OPTIONAL {?v <http://www.w3.org/2000/01/rdf-schema#label> ?l filter (lang(?l)=\"en\")} } } limit 20"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bridgette_Wilson"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Austin_O%27Brien"
          }
        } ]
      }
    } ]
  } ]
}