{
  "dataset" : {
    "id" : "test"
  },
  "questions" : [ {
    "id" : "213",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all movies directed by Francis Ford Coppola."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 <http://dbpedia.org/property/director> <http://dbpedia.org/resource/Francis_Ford_Coppola> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Rain_People"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Godfather_Part_III"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/One_from_the_Heart"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Outsiders_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Terror_(1963_film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Godfather_Part_II"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Twixt_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Cotton_Club_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Tonight_for_Sure"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Peggy_Sue_Got_Married"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Apocalypse_Now_Redux"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bram_Stoker's_Dracula"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Rumble_Fish"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Conversation"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Godfather"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Youth_Without_Youth_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Finian's_Rainbow_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Dementia_13"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Tucker:_The_Man_and_His_Dream"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Gardens_of_Stone"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Rainmaker_(1997_film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/You're_a_Big_Boy_Now"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Tetro"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/New_York_Stories"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Godfather_Saga"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Godfather_(film_series)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Battle_Beyond_the_Sun"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Bellboy_and_the_Playgirls"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Jack_(1996_film)"
          }
        } ]
      }
    } ]
  }, {
    "id" : "231",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all launch pads operated by NASA."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad> . ?s1 <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mid-Atlantic_Regional_Spaceport_Launch_Pad_0"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Keweenaw_Rocket_Range"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Spaceport_Florida_Launch_Complex_36"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Wallops_Flight_Facility_Launch_Area_3"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Broglio_Space_Centre"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Cape_Canaveral_Air_Force_Station_Launch_Complex_13"
          }
        } ]
      }
    } ]
  }, {
    "id" : "249",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List all the musicals with music by Elton John."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 <http://dbpedia.org/property/music> <http://dbpedia.org/resource/Elton_John> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Lion_King_(musical)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Lion_King_Jr_(musical)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Billy_Elliot_the_Musical"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lestat_(musical)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Aida_(musical)"
          }
        } ]
      }
    } ]
  }, {
    "id" : "260",
    "answertype" : "number",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the runtime of Toy Story."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?o1 where { <http://dbpedia.org/resource/Toy_Story> <http://dbpedia.org/property/runtime> ?o1 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "c" ]
      },
      "results" : {
        "bindings" : [ {
          "c" : {
            "type" : "literal",
            "value" : "4860.0"
          }
        } ]
      }
    } ]
  }, {
    "id" : "275",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List the children of Margaret Thatcher."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?o1 where { <http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/property/children> ?o1 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Carol_Thatcher"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mark_Thatcher"
          }
        } ]
      }
    } ]
  }, {
    "id" : "286",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all actors starring in movies directed by William Shatner."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?o3 where { ?s1 <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/William_Shatner> . ?s1 <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/Film> . ?s1 <http://dbpedia.org/ontology/starring> ?o3 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : { }
    } ]
  }, {
    "id" : "290",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List all games by GMT."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 ?p1 <http://dbpedia.org/resource/GMT_Games> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Game> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Washington's_War"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Fields_of_Fire_(game)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Commands_&_Colors:_Ancients"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/A_World_At_War"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Twilight_Struggle"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Sword_of_Rome"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Chandragupta_(board_game)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Paths_of_Glory_(board_game)"
          }
        } ]
      }
    } ]
  }, {
    "id" : "295",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all video games published by Mean Hamster Software."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/Mean_Hamster_Software> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Crossbow_(video_game)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Riven"
          }
        } ]
      }
    } ]
  }, {
    "id" : "296",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all members of Prodigy."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?o1 where { <http://dbpedia.org/resource/The_Prodigy> <http://dbpedia.org/ontology/bandMember> ?o1 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Maxim_(musician)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Liam_Howlett"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Keith_Flint"
          }
        } ]
      }
    } ]
  }, {
    "id" : "305",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Which holidays are celebrated around the world? test2"
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s0 where { VALUES ?s0 { <http://dbpedia.org/resource/Around_the_World> } } LIMIT 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Around_the_World"
          }
        } ]
      }
    } ]
  }, {
    "id" : "313",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the birth place of Frank Sinatra."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?o1 where { <http://dbpedia.org/resource/Frank_Sinatra> <http://dbpedia.org/ontology/birthPlace> ?o1 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Hoboken,_New_Jersey"
          }
        } ]
      }
    } ]
  }, {
    "id" : "347",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show me all books in Asimov's Foundation series."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?o1 where { <http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/books> ?o1 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Foundation's_Edge"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Foundation_(Isaac_Asimov_novel)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Second_Foundation"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Prelude_to_Foundation"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Foundation_and_Earth"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Forward_the_Foundation"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Foundation_and_Empire"
          }
        } ]
      }
    } ]
  }, {
    "id" : "367",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the grandchildren of Elvis Presley."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s0 where { VALUES ?s0 { <http://dbpedia.org/resource/Elvis_Presley> } } LIMIT 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Elvis_Presley"
          }
        } ]
      }
    } ]
  }, {
    "id" : "371",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all books by William Goldman with more than 300 pages."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/William_Goldman> . ?s1 <http://dbpedia.org/property/pages> ?o2 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Control_(novel)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Princess_Bride"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Magic_(novel)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Wait_Till_Next_Year"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Marathon_Man_(novel)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Silent_Gondoliers"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Which_Lie_Did_I_Tell%3F"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Father's_Day_(novel)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Heat_(Goldman_novel)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Hype_and_Glory"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Tinsel_(novel)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Boys_and_Girls_Together"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Temple_of_Gold"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Color_of_Light"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Brothers_(Goldman_novel)"
          }
        } ]
      }
    } ]
  }, {
    "id" : "383",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show me the book that Muhammad Ali wrote."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Muhammad_Ali> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Greatest:_My_Own_Story"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Soul_of_a_Butterfly"
          }
        } ]
      }
    } ]
  }, {
    "id" : "391",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show me Hemingway's autobiography."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 ?p1 <http://dbpedia.org/resource/Ernest_Hemingway> . ?s1 ?p2 <http://dbpedia.org/resource/Autobiography> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/A_Moveable_Feast"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mircea_Nedelciu"
          }
        } ]
      }
    } ]
  }, {
    "id" : "402",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the currency of China."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?o1 where { <http://dbpedia.org/resource/China> ?p1 ?o1 . ?o1 <http://dbpedia.org/property/currency> ?o2 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Taiwan"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/China"
          }
        } ]
      }
    } ]
  }, {
    "id" : "403",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all Swedish oceanographers."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 ?p1 <http://dbpedia.org/resource/Sweden> . ?s1 ?p2 <http://dbpedia.org/resource/Oceanography> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Anna_Wåhlin"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Vagn_Walfrid_Ekman"
          }
        } ]
      }
    } ]
  }, {
    "id" : "412",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all actors starring in Last Action Hero."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?o1 where { <http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> ?o1 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Tom_Noonan"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/F._Murray_Abraham"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Arnold_Schwarzenegger"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mercedes_Ruehl"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Charles_Dance"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Art_Carney"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Austin_O'Brien"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Frank_McRae"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Robert_Prosky"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Anthony_Quinn"
          }
        } ]
      }
    } ]
  } ]
}