{
  "dataset" : {
    "id" : "test"
  },
  "questions" : [ {
    "id" : "1",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List all boardgames by GMT."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s0 where { VALUES ?s0 { <http://dbpedia.org/resource/GMT> } } LIMIT 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/GMT"
          }
        } ]
      }
    } ]
  }, {
    "id" : "11",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all Danish films."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s0 where { VALUES ?s0 { <http://dbpedia.org/resource/Category:Danish_films> } } LIMIT 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Category:Danish_films"
          }
        } ]
      }
    } ]
  }, {
    "id" : "13",
    "answertype" : "number",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the grandchildren of Bruce Lee."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s0 where { VALUES ?s0 { <http://dbpedia.org/resource/Bruce_Lee> } } LIMIT 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "c" ]
      },
      "results" : {
        "bindings" : [ {
          "c" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Bruce_Lee"
          }
        } ]
      }
    } ]
  }, {
    "id" : "20",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the Apollo 14 astronauts."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 ?p1 <http://dbpedia.org/resource/Apollo_14> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Astronaut> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Stuart_Roosa"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Alan_Shepard"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Edgar_Mitchell"
          }
        } ]
      }
    } ]
  }, {
    "id" : "33",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all writers that won the Nobel Prize in literature."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Nobel_Prize_in_Literature> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Writer> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Hermann_Hesse"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Aleksandr_Solzhenitsyn"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ernest_Hemingway"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Czesław_Miłosz"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Joseph_Brodsky"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/José_Saramago"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/John_Steinbeck"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Wisława_Szymborska"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Gerhart_Hauptmann"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Eugene_O'Neill"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Thomas_Mann"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/T._S._Eliot"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Toni_Morrison"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Svetlana_Alexievich"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Pablo_Neruda"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/William_Golding"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Alice_Munro"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Juan_Ramón_Jiménez"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Patrick_Modiano"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Harold_Pinter"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Seamus_Heaney"
          }
        } ]
      }
    } ]
  }, {
    "id" : "34",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show me all basketball players that are higher than 2 meters."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s0 where { VALUES ?s0 { <http://dbpedia.org/resource/2-meter_band> } } LIMIT 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/2-meter_band"
          }
        } ]
      }
    } ]
  }, {
    "id" : "41",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all cosmonauts."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s0 where { VALUES ?s0 { <http://dbpedia.org/resource/Astronaut> } } LIMIT 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Astronaut"
          }
        } ]
      }
    } ]
  }, {
    "id" : "42",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all Swiss non-profit organizations."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 ?p1 <http://dbpedia.org/resource/Switzerland> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Non-ProfitOrganisation> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/FDI_World_Dental_Federation"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/International_Mountain_Society"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/International_Service_for_Human_Rights"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Hear_the_World_Foundation"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Affordable_Medicines_Facility-malaria"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/City_Angels"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/UPR_Info"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Alkarama"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/International_Union_for_Conservation_of_Nature"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Green_Development_Initiative"
          }
        } ]
      }
    } ]
  }, {
    "id" : "46",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show a list of soccer clubs that play in the Bundesliga."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub> . ?s1 <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Borussia_Mönchengladbach"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/SV_Darmstadt_98"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/FC_Augsburg"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bayer_04_Leverkusen"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/FC_Ingolstadt_04"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/VfL_Wolfsburg"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Eintracht_Frankfurt"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/SC_Freiburg"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Hertha_BSC"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/1._FC_Köln"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/SV_Werder_Bremen"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/1._FSV_Mainz_05"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/FC_Schalke_04"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/RB_Leipzig"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/TSG_1899_Hoffenheim"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/FC_Bayern_Munich"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Borussia_Dortmund"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Hamburger_SV"
          }
        } ]
      }
    } ]
  }, {
    "id" : "55",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the capitals of all countries that the Himalayas run through."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?o2 where { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?o1 . ?o1 <http://dbpedia.org/ontology/capital> ?o2 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Thimphu"
          }
        } ]
      }
    } ]
  }, {
    "id" : "64",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all soccer clubs in the Premier League."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 ?p1 <http://dbpedia.org/resource/Premier_League> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Aston_Villa_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Newcastle_United_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Norwich_City_F.C."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Gymnasium_F.C."
          }
        } ]
      }
    } ]
  }, {
    "id" : "68",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all world heritage sites designated within the past two years."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s0 where { VALUES ?s0 { <http://dbpedia.org/resource/World_Heritage_Site> } } LIMIT 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/World_Heritage_Site"
          }
        } ]
      }
    } ]
  }, {
    "id" : "69",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all actors who were born in Paris after 1950."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Paris> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Actor> . ?s1 <http://dbpedia.org/property/after> ?o3 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Sophie_Lothaire"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Louis-François_Ribié"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lecatte-Folleville"
          }
        } ]
      }
    } ]
  }, {
    "id" : "71",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all Australian nonprofit organizations."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 ?p1 <http://dbpedia.org/resource/Australia> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Non-ProfitOrganisation> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Australian_Melanoma_Research_Foundation"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Federation_of_Australian_Historical_Societies"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Oaktree_(foundation)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Justice_Action"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Arthur_Rylah_Institute_for_Environmental_Research"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Cancer_Council_Australia"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Robert_Connor_Dawes_Foundation"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Generations_of_Virtue"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Cancer_Australia"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Women_In_Prison_Advocacy_Network"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Friends_of_the_Earth_Australia"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/NPS_MedicineWise"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Historical_Society_of_the_Northern_Territory"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Australian_Cancer_Research_Foundation"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/United_Nations_Youth_Australia"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Broken_Rites"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Royal_Australian_Historical_Society"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Alannah_and_Madeline_Foundation"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Kilda_Cycling_Club"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Organ_Historical_Trust_of_Australia"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Regional_Arts_Australia"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Association_for_the_Wellbeing_of_Children_in_Healthcare"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/PA_Research_Foundation"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Australian_Rotary_Health"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/SunSmart"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Westmead_Medical_Research_Foundation"
          }
        } ]
      }
    } ]
  }, {
    "id" : "73",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all ESA astronauts."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 ?p1 <http://dbpedia.org/resource/ESA> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Astronaut> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Thomas_Reiter"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Andreas_Mogensen"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Christer_Fuglesang"
          }
        } ]
      }
    } ]
  }, {
    "id" : "78",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all federal chancellors of Germany."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s0 where { VALUES ?s0 { <http://dbpedia.org/resource/Chancellor_of_Germany_(1949–)> } } LIMIT 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Chancellor_of_Germany_(1949–)"
          }
        } ]
      }
    } ]
  }, {
    "id" : "79",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show me everyone who was born on Halloween."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?o1 where { <http://dbpedia.org/resource/Halloween_(wrestler)> <http://dbpedia.org/property/birthPlace> ?o1 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mexico"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Tijuana"
          }
        } ]
      }
    } ]
  }, {
    "id" : "86",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all actors who were born in Berlin."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Actor> . ?s1 <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Dru_Berrymore"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Tyra_Misoux"
          }
        } ]
      }
    } ]
  }, {
    "id" : "87",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Who created Goofy?"
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?o1 where { <http://dbpedia.org/resource/Goofy> <http://dbpedia.org/ontology/creator> ?o1 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Frank_Webb_(cartoonist)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Walt_Disney"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Paul_Murry"
          }
        } ]
      }
    } ]
  }, {
    "id" : "91",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all the TV shows with Neil Patrick Harris."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 ?p1 <http://dbpedia.org/resource/Neil_Patrick_Harris> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Doogie_Howser,_M.D."
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Dr._Horrible's_Sing-Along_Blog"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Best_Time_Ever_with_Neil_Patrick_Harris"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/How_I_Met_Your_Mother"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Joan_of_Arc_(miniseries)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Stark_Raving_Mad_(TV_series)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Too_Good_to_Be_True_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Christmas_Blessing"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Capitol_Critters"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Under_the_Gunn"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Brain_Games_(National_Geographic)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/A_Series_of_Unfortunate_Events_(TV_series)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Robot_Chicken_DC_Comics_Special"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Spider-Man:_The_New_Animated_Series"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Neil's_Puppet_Dreams"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Snowbound:_The_Jim_and_Jennifer_Stolpa_Story"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Goodwin_Games"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Yes,_Virginia_(TV_program)"
          }
        } ]
      }
    } ]
  }, {
    "id" : "94",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all Swedish holidays."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 ?p1 <http://dbpedia.org/resource/Sweden> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Holiday> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Gustavus_Adolphus_Day"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Veterans_Day_(Sweden)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St._Knut's_Day"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Christmas_tree_plundering"
          }
        } ]
      }
    } ]
  }, {
    "id" : "96",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List all the musicals with music by Leonard Bernstein."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 <http://dbpedia.org/property/music> <http://dbpedia.org/resource/Leonard_Bernstein> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Candide_(operetta)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Race_to_Urga"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Wonderful_Town"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/1600_Pennsylvania_Avenue_(musical)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/On_the_Town_(musical)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/A_Party_with_Betty_Comden_and_Adolph_Green"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/West_Side_Story"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Side_by_Side_by_Sondheim"
          }
        } ]
      }
    } ]
  } ]
}