{
  "dataset" : {
    "id" : "test"
  },
  "questions" : [ {
    "id" : "101",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all Australian metalcore bands."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 ?p1 <http://dbpedia.org/resource/Australia> . ?s1 ?p2 <http://dbpedia.org/resource/Metalcore> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Band> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Our_Last_Enemy"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Wish_for_Wings"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/In_Hearts_Wake"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Shoreside"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/House_vs._Hurricane"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mindsnare"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Deez_Nuts_(band)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Azure_Falls"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Embodiment_12:14"
          }
        } ]
      }
    } ]
  }, {
    "id" : "103",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all types of eating disorders."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s0 where { VALUES ?s0 { <http://dbpedia.org/resource/Eating_disorder> } } LIMIT 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Eating_disorder"
          }
        } ]
      }
    } ]
  }, {
    "id" : "109",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all books written by Danielle Steel."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?o2 where { ?s1 <http://dbpedia.org/property/writer> <http://dbpedia.org/resource/Danielle_Steel> . ?s1 <http://dbpedia.org/ontology/author> ?o2 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Paul_Huson"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Danielle_Steel"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/William_Bast"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Claire_Labine"
          }
        } ]
      }
    } ]
  }, {
    "id" : "113",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all libraries established earlier than 1400."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?o1 where { <http://dbpedia.org/resource/Than_E> ?p1 ?o1 . ?o1 <http://dbpedia.org/property/established> ?o2 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Practising_School_Yangon_Institute_of_Education"
          }
        } ]
      }
    } ]
  }, {
    "id" : "128",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all actors called Baldwin."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Adam_Baldwin> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Day_Break"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Evil_Eyes"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Cold_Sweat_(1993_film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Poseidon_Adventure_(2005_film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Full_Metal_Jacket"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Chuck_(TV_series)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Where_the_Day_Takes_You"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Last_Ship_(TV_series)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Next_of_Kin_(1989_film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Serenity_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/My_Bodyguard"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Cruel_Doubt"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/D.C._Cab"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Deadbolt_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/War_of_the_Worlds:_Goliath"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lady_Jayne:_Killer"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Cohen_and_Tate"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Blind_Justice_(1994_film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Poison_Ivy_(1985_film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Cape_(1996_TV_series)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Jackpot_(2001_film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Double_Bang"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Gospel_Hill"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Control_Factor"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Off_Sides_(Pigs_vs._Freaks)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Starquest_II"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Sands_of_Oblivion"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Radio_Flyer_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Inside_(TV_series)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Little_Fish,_Strange_Pond"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Superman:_Doomsday"
          }
        } ]
      }
    } ]
  }, {
    "id" : "136",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show me all songs from Bruce Springsteen released between 1980 and 1990."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Song> . ?s1 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Bruce_Springsteen> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Thunder_Road_(song)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Johnny_99_(song)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Darlington_County_(song)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ramrod_(Bruce_Springsteen_song)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Youngstown_(song)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Backstreets"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Highway_Patrolman"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Just_Like_Fire_Would"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Wreck_on_the_Highway"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Meeting_Across_the_River"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Racing_in_the_Street"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Downbound_Train"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Adam_Raised_a_Cain"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Land_of_Hope_and_Dreams"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/High_Hopes_(Tim_Scott_McConnell_song)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_New_Timer"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Nebraska_(song)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Stolen_Car_(Bruce_Springsteen_song)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Night_(Bruce_Springsteen_song)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Jungleland"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/She's_the_One_(Bruce_Springsteen_song)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Ties_That_Bind_(Bruce_Springsteen_song)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Working_on_the_Highway"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Out_in_the_Street"
          }
        } ]
      }
    } ]
  }, {
    "id" : "141",
    "answertype" : "date",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the birthdays of all actors of the television show Charmed."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?o1 where { <http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> ?o1 . ?o1 <http://dbpedia.org/property/television> ?o2 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "date" ]
      },
      "results" : {
        "bindings" : [ {
          "date" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Kaley_Cuoco"
          }
        } ]
      }
    } ]
  }, {
    "id" : "143",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me a list of all lakes in Denmark."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 ?p1 <http://dbpedia.org/resource/Denmark> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Lake> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Arresø"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lake_Bagsværd"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Furesø_(lake)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bølling_Lake"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Madum_Lake"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Lakes,_Copenhagen"
          }
        } ]
      }
    } ]
  }, {
    "id" : "145",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show me all English Gothic buildings in Kent."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 ?p1 <http://dbpedia.org/resource/English_Gothic_architecture> . ?s1 ?p2 <http://dbpedia.org/resource/Kent> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Building> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Mary's_Church,_Capel-le-Ferne"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Martin_of_Tours_Church,_Detling"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Mary's_Church,_Eastwell"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Church_of_St_Thomas_à_Becket,_Capel"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Mary's_Church,_Higham"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Mary's_Church,_Luddenham"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_James'_Church,_Cooling"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Canterbury_Cathedral"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Clement's_Church,_Knowlton"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Mary's_and_All_Saints_Church,_Boxley"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Mary's_Church,_Burham"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/All_Saints_Church,_Waldershare"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St._Mary's_Church,_Hadlow"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Bartholomew's_Church,_Goodnestone"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Peter's_Church,_Sandwich"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Church_of_St_Mary_the_Virgin,_Fordwich"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Peter's_Church,_Swingfield"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/St_Mary_Magdalene_Church,_Stockbury"
          }
        } ]
      }
    } ]
  }, {
    "id" : "173",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all cities in New Jersey with more than 100000 inhabitants."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?o1 where { <http://dbpedia.org/resource/New_Jersey> <http://dbpedia.org/property/city> ?o1 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "Hamilton Township, Mercer County, New Jersey Hamilton"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "Paterson, New JerseyPaterson"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "Trenton, New JerseyTrenton"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "Jersey City, New JerseyJersey City"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "Newark, New JerseyNewark"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "Lakewood, New JerseyLakewood"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "Toms River, New JerseyToms River"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "Woodbridge, New JerseyWoodbridge"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "Edison, New JerseyEdison"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "Elizabeth, New JerseyElizabeth"
          }
        } ]
      }
    } ]
  }, {
    "id" : "175",
    "answertype" : "string",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all B-sides of the Ramones."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?o1 where { <http://dbpedia.org/resource/Ramones> <http://dbpedia.org/property/b> ?o1 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "string" ]
      },
      "results" : {
        "bindings" : [ {
          "string" : {
            "type" : "literal",
            "value" : "no"
          }
        } ]
      }
    } ]
  }, {
    "id" : "178",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List the seven kings of Rome."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s0 where { VALUES ?s0 { <http://dbpedia.org/resource/King_of_Rome> } } LIMIT 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/King_of_Rome"
          }
        } ]
      }
    } ]
  }, {
    "id" : "181",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show me all the breweries in Australia."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 ?p1 <http://dbpedia.org/resource/Australia> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Brewery> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Cascade_Brewery"
          }
        } ]
      }
    } ]
  }, {
    "id" : "182",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all films produced by Steven Spielberg with a budget of at least $80 million."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Steven_Spielberg> . ?s1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Adventures_of_Tintin_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lost_in_Transit"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Munich_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Always_(1989_film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Hundred-Foot_Journey_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Men_in_Black_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/An_American_Tail:_Fievel_Goes_West"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Dreams_(1990_film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Letters_from_Iwo_Jima"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Lovely_Bones_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/A_Brief_History_of_Time_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Terminal"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Amistad_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Small_Soldiers"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Super_8_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/War_Horse_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Back_to_the_Future:_The_Ride__Back_to_the_Future:_The_Ride__1"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Memoirs_of_a_Geisha_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Men_in_Black_3"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Flags_of_Our_Fathers_(film)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Poltergeist_(1982_film)"
          }
        } ]
      }
    } ]
  }, {
    "id" : "185",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all breeds of the German Shepherd dog."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s1 where { ?s1 <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd> . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mancs_(dog)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Appollo_(dog)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Blondi"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lucca_(dog)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lightning_(dog)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Antis_(dog)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Strongheart"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Nemo_A534"
          }
        } ]
      }
    } ]
  }, {
    "id" : "193",
    "answertype" : "boolean",
    "question" : [ {
      "language" : "en",
      "string" : "Is Cola a beverage?"
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?s0 where { VALUES ?s0 { <http://dbpedia.org/resource/Cola> } } LIMIT 1000"
    },
    "answers" : [ {
      "head" : { },
      "results" : { },
      "boolean" : false
    } ]
  }, {
    "id" : "210",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Who created Batman?"
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT ?o1 where { <http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> ?o1 . } limit 1000"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bill_Finger"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bob_Kane"
          }
        } ]
      }
    } ]
  } ]
}