{
  "dataset" : {
    "id" : "test"
  },
  "questions" : [ {
    "id" : "29",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show me all museums in London."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { <http://dbpedia.org/resource/Agony_in_the_Garden_(Mantegna,_London)> <http://dbpedia.org/ontology/museum> <http://dbpedia.org/resource/London> . <http://dbpedia.org/resource/Agony_in_the_Garden_(Mantegna,_London)> <http://dbpedia.org/ontology/museum> ?uri . ?uri a <http://dbpedia.org/ontology/Museum> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/National_Gallery"
          }
        } ]
      }
    } ]
  }, {
    "id" : "40",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give all swimmers that were born in Moscow."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { ?uri <http://dbpedia.org/property/born> <http://dbpedia.org/resource/Moscow> ; <http://dbpedia.org/property/born> <http://dbpedia.org/resource/Moscow> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mihail_Chemiakin"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mikhail_Romadin"
          }
        } ]
      }
    } ]
  }, {
    "id" : "51",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all Danish movies."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { <http://dbpedia.org/resource/Movies!> <http://dbpedia.org/ontology/pictureFormat> ?uri . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/480i"
          }
        } ]
      }
    } ]
  }, {
    "id" : "55",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the capitals of all countries that the Himalayas run through."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { ?uri a <http://dbpedia.org/ontology/Country> . <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?uri . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bhutan"
          }
        } ]
      }
    } ]
  }, {
    "id" : "87",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Who created Goofy?"
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { <http://dbpedia.org/resource/Goofy> <http://dbpedia.org/ontology/creator> ?uri . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Frank_Webb_(cartoonist)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Walt_Disney"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Paul_Murry"
          }
        } ]
      }
    } ]
  }, {
    "id" : "96",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List all the musicals with music by Leonard Bernstein."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { ?uri <http://dbpedia.org/property/music> <http://dbpedia.org/resource/Leonard_Bernstein> ; <http://dbpedia.org/property/music> <http://dbpedia.org/resource/Leonard_Bernstein> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Faryl"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/SOL3_MIO_(album)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Another_Live"
          }
        } ]
      }
    } ]
  }, {
    "id" : "141",
    "answertype" : "date",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the birthdays of all actors of the television show Charmed."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { <http://dbpedia.org/resource/Kaley_Cuoco> <http://dbpedia.org/property/television> <http://dbpedia.org/resource/Charmed> . <http://dbpedia.org/resource/Kaley_Cuoco> <http://dbpedia.org/property/television> ?uri . ?uri a <http://dbpedia.org/ontology/TelevisionShow> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "date" ]
      },
      "results" : {
        "bindings" : [ {
          "date" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/The_Big_Bang_Theory"
          }
        } ]
      }
    } ]
  }, {
    "id" : "145",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show me all English Gothic buildings in Kent."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { <http://dbpedia.org/resource/Ram_Kamal_Mukherjee> <http://dbpedia.org/property/language> <http://dbpedia.org/resource/English> . <http://dbpedia.org/resource/Ram_Kamal_Mukherjee> <http://dbpedia.org/property/language> ?uri . ?uri a <http://dbpedia.org/ontology/Building> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Hindi"
          }
        } ]
      }
    } ]
  }, {
    "id" : "173",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all cities in New Jersey with more than 100000 inhabitants."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { <http://dbpedia.org/resource/WIBG_(AM)> <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/New_Jersey> . <http://dbpedia.org/resource/WIBG_(AM)> <http://dbpedia.org/ontology/city> ?uri . ?uri a <http://dbpedia.org/ontology/City> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Somers_Point,_New_Jersey"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Ocean_City,_New_Jersey"
          }
        } ]
      }
    } ]
  }, {
    "id" : "178",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List the seven kings of Rome."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { <http://dbpedia.org/resource/Rome> <http://dbpedia.org/ontology/leaderName> ?uri . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Virginia_Raggi"
          }
        } ]
      }
    } ]
  }, {
    "id" : "185",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all breeds of the German Shepherd dog."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { ?uri <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd> ; <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mancs_(dog)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Appollo_(dog)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Blondi"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lucca_(dog)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lightning_(dog)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Antis_(dog)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Strongheart"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Nemo_A534"
          }
        } ]
      }
    } ]
  }, {
    "id" : "210",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Who created Batman?"
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { <http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> ?uri . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bob_Kane"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Bill_Finger"
          }
        } ]
      }
    } ]
  }, {
    "id" : "249",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List all the musicals with music by Elton John."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { ?uri <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Elton_John> ; <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Elton_John> . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Lion_King_(musical)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/The_Lion_King_Jr_(musical)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Billy_Elliot_the_Musical"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Lestat_(musical)"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Aida_(musical)"
          }
        } ]
      }
    } ]
  }, {
    "id" : "260",
    "answertype" : "number",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the runtime of Toy Story."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { <http://dbpedia.org/resource/Toy_Story_3> <http://dbpedia.org/ontology/writer> ?uri . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "c" ]
      },
      "results" : {
        "bindings" : [ {
          "c" : {
            "type" : "literal",
            "value" : "http://dbpedia.org/resource/Michael_Arndt"
          }
        } ]
      }
    } ]
  }, {
    "id" : "275",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "List the children of Margaret Thatcher."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { <http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/child> ?uri . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Carol_Thatcher"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mark_Thatcher"
          }
        } ]
      }
    } ]
  }, {
    "id" : "313",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the birth place of Frank Sinatra."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { <http://dbpedia.org/resource/Frank_Sinatra> <http://dbpedia.org/ontology/birthPlace> ?uri . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Hoboken,_New_Jersey"
          }
        } ]
      }
    } ]
  }, {
    "id" : "347",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Show me all books in Asimov's Foundation series."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { <http://dbpedia.org/resource/Foundation_series> <http://dbpedia.org/property/books> <http://dbpedia.org/resource/Forward_the_Foundation> . <http://dbpedia.org/resource/Forward_the_Foundation> <http://dbpedia.org/ontology/series> ?uri . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Foundation_series"
          }
        } ]
      }
    } ]
  }, {
    "id" : "394",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all Canadian Grunge record labels."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { <http://dbpedia.org/resource/Canadians> <http://dbpedia.org/property/label> ?uri . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Irreligion_in_Canada"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "Other Christian"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "Other religions"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Buddhism_in_Canada"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Hinduism_in_Canada"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Catholicism_in_Canada"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Sikhism_in_Canada"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/History_of_the_Jews_in_Canada"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Islam_in_Canada"
          }
        } ]
      }
    } ]
  }, {
    "id" : "402",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me the currency of China."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { <http://dbpedia.org/resource/China> <http://dbpedia.org/ontology/currency> ?uri . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Renminbi"
          }
        } ]
      }
    } ]
  }, {
    "id" : "412",
    "answertype" : "resource",
    "question" : [ {
      "language" : "en",
      "string" : "Give me all actors starring in Last Action Hero."
    } ],
    "query" : {
      "sparql" : "SELECT DISTINCT * WHERE { <http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> ?uri . }"
    },
    "answers" : [ {
      "head" : {
        "vars" : [ "uri" ]
      },
      "results" : {
        "bindings" : [ {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Tom_Noonan"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/F._Murray_Abraham"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Arnold_Schwarzenegger"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Mercedes_Ruehl"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Charles_Dance"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Art_Carney"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Frank_McRae"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Austin_O'Brien"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Robert_Prosky"
          }
        }, {
          "uri" : {
            "type" : "uri",
            "value" : "http://dbpedia.org/resource/Anthony_Quinn"
          }
        } ]
      }
    } ]
  } ]
}